[
  {
    "id": "1",
    "name": "Amanita muscaria",
    "commonName": "Fly Agaric",
    "family": "Amanitaceae",
    "edibility": "Poisonous",
    "shortDescription": "Iconic red cap with white spots, white stem and gills. Hallucinogenic properties.",
    "longDescription": "Amanita muscaria, commonly known as the fly agaric or fly amanita, is one of the most recognizable and widely encountered mushrooms in popular culture. It is characterized by its vibrant red cap adorned with white wart-like spots, a feature that makes it instantly identifiable. The stem and gills are typically white, and it possesses a ring on the stem. Despite its beauty, this mushroom is known for its poisonous and psychoactive properties, containing compounds like muscimol and ibotenic acid. Historically, it has been used in religious and shamanistic rituals in various cultures. Its distinctive appearance has made it a common motif in fairy tales, children's stories, and video games.",
    "habitat": "Deciduous and coniferous forests",
    "season": "Late summer to late autumn",
    "funFact": "Featured in Alice in Wonderland and traditional Christmas decorations."
  },
  {
    "id": "2",
    "name": "Cantharellus cibarius",
    "commonName": "Chanterelle",
    "family": "Cantharellaceae",
    "edibility": "Edible and Choice",
    "shortDescription": "Golden-yellow, funnel-shaped cap with wavy edges and false gills.",
    "longDescription": "Cantharellus cibarius, commonly known as the chanterelle, is a highly prized edible mushroom found in forests around the world. Its distinctive golden-yellow color and funnel-like shape make it easily recognizable to foragers. The cap has wavy, irregular edges that curve downward, and instead of true gills, it has false gills or ridges that run down the stem. Chanterelles are known for their delicate, fruity aroma often compared to apricots, and a mildly peppery taste. They form mycorrhizal relationships with trees, particularly oaks and conifers, which makes them difficult to cultivate commercially. Chanterelles are rich in vitamin C, D, and various minerals, making them not just a culinary delight but also nutritionally valuable.",
    "habitat": "Hardwood forests, especially near oak and beech trees",
    "season": "Summer to autumn",
    "funFact": "Has a fruity aroma reminiscent of apricots."
  },
  {
    "id": "3",
    "name": "Morchella esculenta",
    "commonName": "Common Morel",
    "family": "Morchellaceae",
    "edibility": "Edible (when cooked)",
    "shortDescription": "Honeycomb-like cap with ridges and pits, hollow stem.",
    "longDescription": "Morchella esculenta, known as the common morel or yellow morel, is one of the most sought-after edible mushrooms in the world. Its distinctive appearance features a honeycomb-like cap with a network of ridges and pits, resembling a sponge or pine cone. The cap is typically yellow to brown and attached to a hollow, white to yellowish stem. Morels are prized for their unique, nutty flavor and meaty texture. They form mycorrhizal relationships with trees but can also appear in disturbed grounds and old orchards. Morels must be cooked before eating, as they contain hydrazine toxins that are destroyed by heat. Their elusive nature and short fruiting season make them a special treat for mushroom enthusiasts and a valuable commodity in gourmet cuisine.",
    "habitat": "Woodlands, orchards, and disturbed grounds",
    "season": "Spring",
    "funFact": "Highly prized in French cuisine."
  },
  {
    "id": "4",
    "name": "Boletus edulis",
    "commonName": "Penny Bun",
    "family": "Boletaceae",
    "edibility": "Edible and Choice",
    "shortDescription": "Large, brown cap with white pores underneath, thick white stem.",
    "longDescription": "Boletus edulis, commonly known as penny bun, porcini, or cep, is a prized edible mushroom found in Europe, North America, and Asia. It is characterized by its large, brown cap that can reach up to 10 inches in diameter, resembling a bread bun. The underside of the cap features tiny white pores instead of gills, which turn yellowish-green as the mushroom matures. The stem is thick, white, and often bulbous at the base. Boletus edulis is renowned for its rich, nutty flavor and meaty texture, making it a staple in Italian, French, and other European cuisines. It forms mycorrhizal associations with various trees, particularly oaks and conifers. The mushroom is not only delicious but also nutritious, being low in fat and high in protein, vitamins, and minerals.",
    "habitat": "Mixed woodlands, particularly with oak and pine",
    "season": "Late summer to autumn",
    "funFact": "Known as 'porcini' in Italy, it's a prized ingredient in many cuisines."
  },
  {
    "id": "5",
    "name": "Pleurotus ostreatus",
    "commonName": "Oyster Mushroom",
    "family": "Pleurotaceae",
    "edibility": "Edible",
    "shortDescription": "Fan-shaped caps growing in clusters, with short or absent stems.",
    "longDescription": "Pleurotus ostreatus, commonly known as the oyster mushroom, is a widely cultivated and foraged edible mushroom. It's characterized by its oyster-shaped or fan-like caps that grow in clusters on dead or dying hardwood trees. The caps can range from white to gray or tan and have decurrent gills underneath. Oyster mushrooms are known for their versatility in cooking, with a subtle, savory flavor and tender texture. They're also notable for their nutritional value, being low in calories but rich in protein, fiber, vitamins, and minerals. Interestingly, oyster mushrooms are one of the few known carnivorous mushrooms; they can trap and digest nematodes, which they use as a nitrogen source. This ability, combined with their fast growth and adaptability, makes them popular in mycoremediation projects for cleaning up environmental pollutants.",
    "habitat": "Dead or dying hardwood trees",
    "season": "Year-round, peaks in fall and spring",
    "funFact": "One of the few carnivorous mushrooms, known to trap and digest nematodes."
  },
  {
    "id": "6",
    "name": "Agaricus bisporus",
    "commonName": "Button Mushroom",
    "family": "Agaricaceae",
    "edibility": "Edible",
    "shortDescription": "White to brown cap with pink to dark brown gills, cultivated variety.",
    "longDescription": "Agaricus bisporus, known variously as the button mushroom, white mushroom, or champignon mushroom, is the most widely cultivated mushroom in the world. In its immature form, it has a small, round, white cap and short stem, resembling a button. As it matures, the cap flattens and can turn brown, at which stage it's often sold as a cremini or chestnut mushroom. The fully mature form, with a large, flat cap and dark gills, is known as a portobello mushroom. A. bisporus has a mild, earthy flavor that intensifies with cooking. It's incredibly versatile in culinary applications and is a staple in many cuisines worldwide. Nutritionally, it's low in calories but high in B vitamins, copper, and selenium. The ease of cultivation and its adaptability to various growing conditions have made A. bisporus a cornerstone of the commercial mushroom industry.",
    "habitat": "Grasslands and meadows (wild variety)",
    "season": "Year-round (cultivated)",
    "funFact": "The most widely cultivated mushroom in the world."
  },
  {
    "id": "7",
    "name": "Ganoderma lucidum",
    "commonName": "Reishi",
    "family": "Ganodermataceae",
    "edibility": "Medicinal (not typically eaten)",
    "shortDescription": "Red-varnished, kidney-shaped cap with white edge, woody texture.",
    "longDescription": "Ganoderma lucidum, commonly known as reishi or lingzhi, is a polypore fungus renowned for its use in traditional medicine. It's characterized by its distinctive appearance: a kidney-shaped cap with a red-varnished, lacquered look and a white edge. The texture is woody and tough. Unlike many edible mushrooms, reishi is primarily valued for its purported medicinal properties rather than as a food. It has been used in traditional Chinese medicine for over 2,000 years and is often referred to as the 'mushroom of immortality.' Modern research has investigated its potential immunomodulating, anti-inflammatory, and anti-tumor properties, though more studies are needed to confirm its efficacy. Reishi typically grows on hardwood trees and is now widely cultivated for use in dietary supplements and health products.",
    "habitat": "Dead or dying hardwood trees",
    "season": "Year-round",
    "funFact": "Used in traditional Chinese medicine for over 2,000 years."
  },
  {
    "id": "8",
    "name": "Lentinula edodes",
    "commonName": "Shiitake",
    "family": "Omphalotaceae",
    "edibility": "Edible",
    "shortDescription": "Brown, umbrella-shaped cap with white gills, curved stem.",
    "longDescription": "Lentinula edodes, commonly known as shiitake, is an edible mushroom native to East Asia. It's characterized by its medium-to-large brown cap, which is typically umbrella-shaped when mature. The underside features white gills, and the stem is usually curved and fibrous. Shiitake mushrooms have a rich, savory flavor often described as umami, making them a popular ingredient in many Asian cuisines. They can be used fresh or dried, with dried shiitake often having a more intense flavor. Beyond their culinary value, shiitake mushrooms have been used in traditional medicine for centuries and are being studied for their potential health benefits, including immune system support and cholesterol reduction. They are rich in B vitamins, copper, and selenium. Shiitake cultivation began in China during the Song dynasty and has since spread worldwide, making it one of the most popular cultivated mushrooms after the button mushroom.",
    "habitat": "Decaying hardwood trees (wild variety)",
    "season": "Spring and autumn (wild), year-round (cultivated)",
    "funFact": "Its name comes from the Japanese words 'shii' (tree) and 'take' (mushroom)."
  },
  {
    "id": "9",
    "name": "Tremella fuciformis",
    "commonName": "Snow Fungus",
    "family": "Tremellaceae",
    "edibility": "Edible",
    "shortDescription": "White, gelatinous, lobed structure resembling a flower.",
    "longDescription": "Tremella fuciformis, commonly known as snow fungus or white jelly mushroom, is a species of edible fungus particularly popular in Asian cuisine and traditional medicine. It's characterized by its striking appearance: a white, gelatinous, lobed structure that resembles a delicate flower or a piece of white coral. When dried, it becomes yellowish and shriveled, but it quickly rehydrates and expands when soaked in water. Snow fungus has a mild, slightly sweet taste and a crunchy, jelly-like texture. It's often used in desserts and soups in Chinese cuisine, prized not only for its unique texture but also for its perceived health benefits. In traditional Chinese medicine, it's believed to have anti-inflammatory properties and is used to promote lung and skin health. Modern research has begun to investigate its potential medicinal properties, including its high polysaccharide content and possible immunomodulating effects.",
    "habitat": "Dead branches of broadleaf trees",
    "season": "Year-round in tropical climates",
    "funFact": "Used in Chinese desserts and believed to have medicinal properties."
  },
  {
    "id": "10",
    "name": "Coprinopsis atramentaria",
    "commonName": "Inky Cap",
    "family": "Psathyrellaceae",
    "edibility": "Edible with caution",
    "shortDescription": "Gray, bell-shaped cap that dissolves into black ink-like liquid when mature.",
    "longDescription": "Coprinopsis atramentaria, commonly known as the inky cap or tippler's bane, is a unique and intriguing mushroom species. It's characterized by its gray, bell-shaped cap that, as it matures, begins to dissolve from the edges inward into a black, ink-like liquid - a process called deliquescence. This autodigestion is actually a method of spore dispersal. The stem is white and hollow, often with a small ring. While considered edible when young and properly cooked, inky caps come with a significant caution: they contain coprine, a compound that interferes with the body's ability to break down alcohol. If alcohol is consumed within a few days of eating these mushrooms, it can cause a severe reaction similar to that caused by disulfiram, a drug used to treat alcoholism. Symptoms can include flushing, nausea, vomiting, and palpitations. This interaction has led to its nickname 'tippler's bane' and its use in some traditional medicines as a deterrent for alcoholism.",
    "habitat": "Lawns, meadows, and wood chips",
    "season": "Spring to autumn",
    "funFact": "Contains coprine, which causes alcohol intolerance if consumed within days of drinking alcohol."
  }
]
